{
	"title": "Field Specific Error",

	"reference-overview": 
		"<p>The Field Specific Error Message appears whenever the user makes a mistake on a Form Element, like failing to fill out a required Text Input field. The Field Specific Error Message pinpoints where exactly on the form the error or errors occurred.</p><p>The Field Specific Error Message differs from the Generic Error Message because it highlights the exact field in which the error was made. The Generic Error Message appears in the form of the <a href='/base/boxes/message-error'>Error Message Container</a> at the top of the page and explains that the user made a mistake or several errors on the page that need to be corrected in order to properly submit the form.</p><p>The incorrect field will be highlighted with the appropriate Error/Negative <a href='/base/colors'>Color Palette</a> and Error Icon (Red circle with exclamation mark inside). There will also be a brief explanation of what the user did wrong right below the Text Input field if the designer decides to enable this feature.</p><p>To see the Field Specific Error Message in action, check out the Page <a href='/error-handling'>Error Messaging &amp; Handling narrative</a>.</p>",

	"reference-usage": 
		"<p>Use the Field Specific Error Message when an error occurs on a specific field within a form in order to pinpoint where the user went wrong and what needs to be done to correct it.</p>",

	"reference-details": 
		"<h3>Behavior</h3><p>When a user submits a form that contains some type of error, the following should occur for each field where an error has occurred:<ul><li>The Field Label will turn to the red error Text color.</li><li>If a required icon (grey asterisk) is associated with a field, then it will turn red to indicate the incorrect field.</li><li>The background of the form element will switch to the Background error color.</li><li>The field specific error message will display immediately below the field element.</li></ul><h3>Messaging</h3><ul><li>All field specific error messages should be succint with a limited number of characters</li><li>All error messages should be written using Sentence Case.</li></ul><h3>Visual Formatting</h3><ul><li>Error Messages should adhere to the approved Mercer color palette for all aspects of the container: Background, Border, and Text.</li></ul><h3>Positioning</h3><ul><li>The field specific error message should always display directly below the incorrect field in red.</li></ul><h3>Related Components</h3></p><p>The following components are all related to this narrative.</p><ul><li><a href='/base/boxes/message-error'>Error Message Container</a></li><li><a href='/error-handling'>Page Error Messaging &amp; Handling</a></li><li><a href='/base/icons'>Required Icon</a></li></ul>",

	"reference-mobile": 
		"<p>There is no visual change in the mobile version of field specific error messaging.</p>",

	"reference-technical": 
		"<h3>Cross browser compatibility</h3><p>IE9 doesn't crop background gradients on containers with rounded corners, so we square the corners of every container so it looks just like IE8.</p>",

	
	"reference-dependency": "false",
	"reference-dependency-jquery": "false",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "true",
	"reference-example-version-label":
		"Stacked Form Error Handling",
	"reference-example-version-label-2":
		"Inline Form Error Handling",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"<p>When there is an error with the form you will need to place the class <code>mul-error</code> on the <code>li</code> tag to acheive the above styling.</p>",
	"reference-code-html-content-block-post": 
		"",
	"reference-code-html-content-block-pre-2": 
		"",
	"reference-code-html-content-block-post-2": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}