{
	"title": "Inline Forms",

	"reference-overview": 
		"<p>The Inline Form displays the Field Labels and the associated Form Fields on the same line with one another.</p>",

	"reference-usage": 
		"<p>An Inline Form is best used when the system has more control over the specific layout of the page (when <strong>end-user configurability is less important</strong>).</p><p>It is also a good solution in cases <strong>when there are numerous fields</strong>, and a <strong>smaller amount of screen real estate</strong> is available.</p><p>When using an Inline Form, the preference is to <strong>use the Right Aligned version</strong>, as this creates a tighter association between the Field Label and the Form Field. The Left Aligned form is availble to be used, but the excess white space between the Form Label and the Form Field creates issues with readability.</p>",

	"reference-details": 
		"<h3>Margins</h3><p>In order to keep with Mercer consistency, the margins between Elements have been standardized:</p><ul><li>Use a 10 pixel bottom between the Element and next Field Label.</li><li>Use a 3 pixel bottom margin between a Label and an Input.</li></ul><h3>Labels</h3><p>All field labels should use Title Case. See the <a href='/copy-text-styleguide'>Copy/Text Style Guide narrative</a> for more detail.</p><h3>Active State</h3><p>The active state for any field should be indicated by the application of the \"Attention\" color to the border of the specific field the user has clicked into.</p><h3>Required Fields</h3><p>All required fields should be denoted by placing the Required icon (the <code>mul-asterisk-small</code> icon from the <a href='/base/icons'>list of icons</a>) immediately to the left of the Field Label.</p><h3>Error Handling</h3><p>See the <a href=\"/base/forms/field-specific-error\">Field Specific Error Message</a> page for details.</p>",

	"reference-mobile": 
		"<p>In the mobile version, all text is slightly larger and buttons span the entire width of their container. Input areas and drop-down menus also grow to span the entire width of the container.</p><p>All forms become stacked for mobile and whether the labels are right or left aligned in the stacked form for desktop, they all become left aligned and stacked for mobile.</p>",

	"reference-technical": 
		"<p>Technical details go here...</p>",

	
	"reference-dependency": "false",
	"reference-dependency-jquery": "false",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "true",
	"reference-example-version-label":
		"Inline Form",
	"reference-example-version-label-2":
		"Inline Form with Right Aligned Labels",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"<p>To right align labels in a form please use the following class name in the form tag: <code>mul-form-label-right</code>.</p>",
	"reference-code-html-content-block-post": 
		"",
	"reference-code-html-content-block-pre-2": 
		"",
	"reference-code-html-content-block-post-2": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}