{
	"title": "Form Radio Buttons",

	"reference-overview": 
		"<p>Radio buttons display a set of mutually exclusive, but related, choices. Only one radio button can be selected at a time.</p>",

	"reference-usage": 
		"<p>Radio buttons are used when there is a list of two or more options that are mutually exclusive and the user must select exactly one choice. Clicking a non-selected radio button will deselect whatever other button was previously selected in the list. If more options are to be allowed at the same time you should use <a href='/base/forms/checkbox'>Checkboxes</a> instead.</p><h3>Subheaders</h3><p>Use subheads to break up a long list of radio buttons into logical groups. This makes the choices faster to scan and easier to understand.<h3>Radio Buttons vs. Single Select Drop Down</h3></p><p>These two form elements function pretty much the same way. The suggestion is to use <strong>Drop Down</strong> when the user doesn't need to know all of the alternative choices available (ie. selecting a \"State\" like Massachusetts. The other options don't matter) or useful for a long list.</p><p>Use <strong>Radio Buttons</strong> when the alternatives matter - when you want the user to see what they are not choosing. Radio buttons allow you to expand the selection and even use longer text.</p>",

	"reference-details": 
		"<p>When a radio button is initially selected the Active State (see below) is highlighted using the \"Attention\" color and a black circle is added to indicate selection.</p><h3>Margins</h3><p>In order to keep with Mercer consistency, the margins between Elements have been standardized:</p><ul><li>Use a 10 pixel bottom between the Element and next Field Label.</li><li>Use a 3 pixel bottom margin between a Label and an Input.</li></ul><h3>Labels</h3><p>All field labels should use Title Case. See the <a href='/copy-text-styleguide'>Copy/Text Style Guide narrative</a> for more detail.</p><h3>Active State</h3><p>The active state for any field should be indicated by the application of the \"Attention\" color to the border of the specific field the user has clicked into. See <a href='/base/colors'>Color Palette</a> for more details on \"Attention\" color.</p><h3>Required Fields</h3><p>All required fields should be denoted by placing the Required icon (the <code>mul-asterisk-small</code> icon from the <a href='/base/icons'>list of icons</a>) immediately to the left of the Field Label.</p><h3>Error Handling</h3><p>See the <a href='/base/forms/field-specific-error'>Field Specific Error Message</a> page for details.</p>",

	"reference-mobile": 
		"<p>The font will increase slightly for mobile.</p>",

	"reference-technical": 
		"<p>The overall table will stretch to fit 100% of the available width, but part of the table may not initially be viewable. The user can access the complete table by scrolling horizontally.</p>",

	
	"reference-dependency": "false",
	"reference-dependency-jquery": "false",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "true",
	"reference-example-version-label":
		"Stacked Radio Buttons",
	"reference-example-version-label-2":
		"Inline Radio Buttons",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"",
	"reference-code-html-content-block-post": 
		"",
	"reference-code-html-content-block-pre-2": 
		"",
	"reference-code-html-content-block-post-2": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}