{
	"title": "Selected Checkbox",

	"reference-overview": 
		"<p>The Selected Checkbox is a form add-on that makes it easier for users to see the selections they have made on a form. When the user checks a selection, it will be highlighted in green.</p>",

	"reference-usage": 
		"<p>Use the Selected Checkbox when a form contains a large number of possible selections to a question, so users can see what exactly they have checked off. For example, if a user needs to check off countries visited or hobbies/interests, there will most likely be a lot of options on the form. The Selected Checkbox is the perfect option to allow users to keep track of their selections.</p>",

	"reference-details": 
		"<p>When a checkbox is initially selected the Active State (see below) is highlighted using the \"Attention\" color and the green background indicates selection.</p><h3>Margins</h3><p>In order to keep with Mercer consistency, the margins between Elements have been standardized:</p><ul><li>Use a 10 pixel bottom between the Element and next Field Label.</li><li>Use a 3 pixel bottom margin between a Label and an Input.</li></ul><h3>Labels</h3><p>All field labels should use Title Case. See the <a href='/copy-text-styleguide'>Copy/Text Style Guide narrative</a> for more detail.</p><h3>Active State</h3><p>The active state for any field should be indicated by the application of the \"Attention\" color to the border of the specific field the user has clicked into. See <a href='/base/colors'>Color Palette</a> for more details on \"Attention\" color.<br><br>Designers can apply the CSS class <code>evo-checkbox-checked</code> to the <a href='/base/forms/checkbox'>Checkbox</a> element in order to make it a Selected Checkbox with the green background.</br></p><h3>Required Fields</h3><p>All required fields should be denoted by placing the Required icon (the <code>evo-asterisk-small</code> icon from the <a href='/base/icons'>list of icons</a> ) immediately to the left of the Field Label.</p><h3>Error Handling</h3><p>See the <a href='/base/forms/field-specific-error'>Field Specific Error Message</a> page for details.</p>",

	"reference-mobile": 
		"<p>Check-boxes expand to the entire row and stacks in order presented, while font size increases. Each option, which can be selected by using the check-box or clicking anywhere in the area, changes color to indicate selection and check-box becomes selected.</p>",

	"reference-technical": 
		"<p>Technical details will go here...</p>",

	
	"reference-dependency": "true",
	"reference-dependency-jquery": "true",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "true",
	"reference-example-version-label":
		"Stacked",
	"reference-example-version-label-2":
		"Inline",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"<p>The selected checkbox allows the user to click and higlight a larger area. For this to work you would need to place a class of <code>js-evo-selected-checkbox</code> on the <code>form</code> tag.</p>",
	"reference-code-html-content-block-post": 
		"",
	"reference-code-html-content-block-pre-2": 
		"",
	"reference-code-html-content-block-post-2": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}