{
	"title": "Stacked Form",

	"reference-overview": 
		"<p>A Stacked Form is a form where the Form Label is stacked on top of the Form Field. The stacked form is comprised of two main elements the Form label and Form field. In this use the form label is \"stacked\" on top of the form field.</p>",

	"reference-usage": 
		"<p>Stacked Forms are typically a default layout for forms.</p><p>Stacked Forms are best used when a high level of end-user configurability is necessary. In cases like this, we have less control over the specific placement of all fields, so the flexibility of spacing is important.</p><p>The Stacked Form is flexible because it allows you to configure optional elements:</p><ul><li>Hiding/displaying Fields</li><li>Changing the values of Field Labels</li><li>Localization/translation of Field Labels</li></ul><p>The Stacked Form works well when you want the user to read a Label and take an action directly underneath. However, for aesthetic purposes, it might be a good idea to use one of the other types of Forms if its contents are on the long side.</p>",

	"reference-details": 
		"<h3>Margins</h3><p>In order to keep with Mercer consistency, the margins between Elements have been standardized:</p><ul><li>Use a 10 pixel bottom between the Element and next Field Label.</li><li>Use a 3 pixel bottom margin between a Label and an Input.</li></ul><h3>Labels</h3><p>All field labels should use Title Case. See the <a href='/copy-text-styleguide'>Copy/Text Style Guide narrative</a> for more detail.</p><h3>Active State</h3><p>The active state for any field should be indicated by the application of the \"Attention\" color to the border of the specific field the user has clicked into.</p><h3>Required Fields</h3><p>All required fields should be denoted by placing the Required icon (the <code>mul-asterisk-small</code> icon from the <a href='/base/icons'>list of icons</a>) immediately to the left of the Field Label.</p><h3>Error Handling</h3><p>See the <a href='/base/forms/field-specific-error'>Field Specific Error Message</a> page for details.</p>",

	"reference-mobile": 
		"<p>In the mobile version of forms, all text is slightly larger and buttons span the entire width of their container. Form elements stack vertically and also grow to span the entire width of the container (other than checkboxes, radio buttons, and the calendar date range picker).</p>",

	"reference-technical": 
		"<h3>Header</h3><p>Technical details go here. This is a <a href='/objects/mini-filter'>link</a>.</p><h4>Sub Header</h4><ul><li>List item 1</li><li>List item 2</li><li>List item 3</li></ul><h4>Sub Header</h4><ol><li>List item 1</li><li>List item 2</li><li>List item 3</li></ol><dl><dt>Definiton term</dt><dd>Definiton description</dd><dd>Definiton description</dd><dd>Definiton description</dd></dl>",

	
	"reference-dependency": "false",
	"reference-dependency-jquery": "false",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "false",
	"reference-example-version-label":
		"",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"",
	"reference-code-html-content-block-post": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}