{
	"title": "Thin Footer",

	"reference-overview": 
		"The Thin Footer is an optional footer container that appears consistently at the bottom of every page. It usually contains logo and copyright information as well as some links to product line specific information. If more information is need, the Fat Footer (link to fat footer) can be used to expose a deeper level of the site hierarchy to the user.",

	"reference-usage": 
		"The Thin Footer should be used to display logo and copyright information and any other links that provide secondary information about the product. ie. Privacy, Terms, About Us. When it is important to expose users to a deeper level of the site structure, The Fat Footer (link to fat footer) should be used in place of the Thin Footer.",

	"reference-details": 
		"<ul><li>The width of the Thin Footer will span 100% of the browser window.</li><li>The content within the Thin Footer will be displayed inside the centered 980px wide content container.</li><li>Any type of grid layout can be used inside the Thin Footer.</li><li>The default background color of the Thin Footer is #FFFFFF.</li><li>The default text color of all the content in the Thin Footer is # #2C2C2C.</li></ul>",

	"reference-mobile": 
		"<ul><li>The mobile version of the Thin Footer will continue to span 100% of the available screen space.</li><li>The items in the Thin Footer will stack on top of each other</li><li>The overall font size of the content in the Thin Footer will increase</li></ul>",

	"reference-technical": 
		"<p>Technical details go here...</p>",

	
	"reference-dependency": "false",
	"reference-dependency-jquery": "false",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": "",

	"reference-example-versions": "false",
	"reference-example-version-label": "",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": "",
	"reference-code-html-content-block-post": "",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": "",
	"reference-code-js-content-block-post": ""
}