{
	"title": "Sidebar Container",

	"reference-overview": 
		"<p>The Sidebar Container is a secondary containing element that should be used to create a visual \"spine\" for a page. It essentially separates content on the left and right sides of the page.</p>",

	"reference-usage": 
		"<p>Use the Sidebar Container when you want to separate content on the page into more than one vertical section. The Sidebar Container can also be used when you want to create a vertical interactive menu on the left or right side of the page.</p>",

	"reference-details": 
		"<h3>Components</h3><ul><li>The Sidebar Container is comprised of the following three components:</li><ul><li>Border</li><li>Background</li><li>Content Area</li></ul><li>The Border color (#cccccc) should always be a solid, 1 pixel gray line.</li><li>The Background color (#eeeeeee) should always be gray.</li><li>The Content Area included in a sidebar container will always include:</li><ul><li>Header</li><li>Horizontal Line</li></ul><li>The headers for the Content Area in a Sidebar Containers should always be designated as an h3.</li><li>The Horizontal Line directly under the Feature Container's header can be any color depending on where it is used.</li><li>A Sidebar Container may include multiple Content Areas.</li></ul><h3>Sizing and Layout</h3><ul><li>The content margins inside all Mercer Sidebar Containers will have 15 pixels of padding all around.</li><li>The padding inside a Sidebar Container from the line under the header to the beginning of the actual content is also 15 pixels.</li><li>Sidebar Container height and width are variable based on inside content height and width.</li></ul><h3>Grids</h3><ul><li>Sidebar Containers work within the <a href=\"/base/grids\">Mercer Evolution Grid System</a>.</li><li>Sidebar Containers can contain grids inside of them to display and section off data within the container.</li></ul>",

	"reference-mobile": 
		"<ul><li>In the mobile version of this container the width will shrink to span the width of the parent container.</li><li>Font size increases for mobile.</li></ul>",

	"reference-technical": 
		"<p>The Feature Container is designed to work and display the same way across all browsers.</p>",

	
	"reference-dependency": "false",
	"reference-dependency-jquery": "false",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "false",
	"reference-example-version-label":
		"",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"<p>All containers start with base box and in this example we are using the following class <code>mul-sidebar-ctn</code> to give more meaning to a basic box. For the header part of the container, adjust the header tag size in conjunction with the class of <code>mul-hdr-rule</code>. Recommended header tags are <code>h1</code>, <code>h2</code>, <code>h3</code></p>",
	"reference-code-html-content-block-post": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}