{
    "title": "Buttons",

    "reference-overview": 
        "<p>Buttons act as the focal point for user interaction as it relates to saving data or completing an action.</p><p>For more detailed button color specifications check our the <a href='/base/colors#buttonColors'>color palette</a>.</p>",

    "reference-usage": 
        "<p>There are two button styles:</p><dt>Primary Button</dt><ul><li>Used for the primary action on the page. There is usually only one Primary Button on a screen in order to avoid user confusion.</li><li> The Primary Button is essentially the \"single most important\" call-to-action you want the user to take.</li><li>Multiple primary buttons will confuse the user and should be avoided.</li></ul><dt>Secondary Button</dt><ul><li>Designed to be visually offset from the Primary button.</li><li>There can be more than one Secondary Button on a screen.</li><li> Secondary Buttons are essentially additional options the user has on the page, just not the \"primary call-to-action.\"</li></ul><p>Buttons are different than links as links take you to another page, and therefore they have different uses. Buttons should be used for the following:</p><ul><li>As navigation in a multi-step flow (user will be going through a process or a wizard).</li><li>To save data entered on a form</li><li>As a click event action to invoke another interaction on the page. For example, toggling content, hiding and showing content, sliding a panel, etc.</li></ul>",

    "reference-details": 
        "<ul><li>Each button has 4 states: static, hover, active, and loading (optional).</li><li>In the optional \"loading\" state, the button should be disabled to prevent the user from clicking multiple times. When this occurs, the button should also change style to also look like it's in a disabled state.</li><li>Buttons are entirely created with CSS. No images should be used.</li><li>Buttons used as \"links\" and buttons used with \"forms\" should look the same, but the functions can differ. For instance, you can make a link look like a button, but it will not have the \"submit\" function of a button with type of \"submit.\"</li><li>The buttons should be able to be aligned to one another horizontally for consistency of Mercer branding.</li></ul><dt>Width</dt><ul><li>Each button should have a <strong>minimum width of 100 pixels</strong> , but they can expand to match content length if needed.</li><li>The final width of the button should be dynamic based on the content inside the button.</li></ul><dt>Labels</dt><ul><li>Button text should be a concise, specific call to action. Try to use one word, two at the most, and make it active voice.</li><li>Button text should Title Case - except in the \"loading\" state where lowercase is used to visually offset this state from the others</li></ul><dt>Primary Buttons are:</dt><ul><li>Green gradient in default state</li><li>Green gradient in active state</li><li>Green gradient in hover state</li><li>Green solid in loading state (text must also display \"loading\")</li></ul><dt>Secondary Buttons are:</dt><ul><li>Grey gradient in default state</li><li>Grey gradient in active state</li><li>Grey gradient in hover state</li><li>Light grey solid in loading state (text must also display \"loading\")</li></ul>",

    "reference-mobile": 
        "<ul><li>The width of all Buttons will expand to stretch the available content area.</li><li>Instead of displaying side by side, all related Buttons will stack on top of one another in the presented order.</li><li>The text size for all labels will increase by 2px.</li><li>The entire button remains &quot;clickable.&quot;</li><li>All states of buttons - Primary, Secondary, hover, disabled, etc.- remain in effect.</li></ul>",

    "reference-technical": 
        "<h3>Cross Browser Compatibility</h3><p>IE9 doesn't crop background gradients on rounded corners, so we square the corners of the button. Related, with \"Loading\" buttons, IE9 jankifies disabled button elements, rendering text gray with a nasty text-shadow that we cannot fix.</p>",

    
    "reference-dependency": "true",
    "reference-dependency-jquery": "true",
    "reference-dependency-jquery-ui": "false",
    "reference-dependency-list": 
        "",

    "reference-example-versions": "true",
    "reference-example-version-label":
        "Default Buttons",
    "reference-example-version-label-2":
        "Interactive Buttons",
    "reference-example-version-label-3":
        "Disabled Buttons",
    "reference-example-version-label-4":
        "Multi Step Example",
    "reference-example-version-label-5":
        "Minimum Width",
    "reference-example-version-label-6":
        "Long Text",

    "reference-get-code": "true",

    "reference-code-html-content-block-pre": 
        "<p>When using the buttons stacked side by side always use \"evo-btn-first\" class on the first button to remove the margin.</p>",
    "reference-code-html-content-block-post": 
        "",
    "reference-code-html-content-block-pre-2": 
        "",
    "reference-code-html-content-block-post-2": 
        "",
    "reference-code-html-content-block-pre-3": 
        "<p>In order to create the interactivity, you will need the following class to be added: <code>js-evo-btn-loading</code>.</p>",
    "reference-code-html-content-block-post-3": 
        "",
    "reference-code-html-content-block-pre-4": 
        "<p>The \"medium\" size button is the default size of buttons. In order to get the button size of \"medium\", a class helper of <code>evo-btn-medium</code> is used. The following button size class helpers are also available:</p>",
    "reference-code-html-content-block-post-4": 
        "",
    "reference-code-html-content-block-pre-5": 
        "",
    "reference-code-html-content-block-post-5": 
        "",
    "reference-code-html-content-block-pre-6": 
        "",
    "reference-code-html-content-block-post-6": 
        "",

    "reference-code-js": "false",
    "reference-code-js-content-block-pre": 
        "",
    "reference-code-js-content-block-post": 
        "",

    "reference-button-sizes-table-data": [
    {
    "button-size-label" : "XXX-small",
    "button-size" : "xxx-small"
    },
    {
    "button-size-label" : "XX-small",
    "button-size" : "xx-small"
    },
    {
    "button-size-label" : "X-small",
    "button-size" : "x-small"
    },
    {
    "button-size-label" : "Small",
    "button-size" : "small"
    },
    {
    "button-size-label" : "Medium",
    "button-size" : "medium"
    },
    {
    "button-size-label" : "Large",
    "button-size" : "large"
    },
    {
    "button-size-label" : "X-large",
    "button-size" : "x-large"
    },
    {
    "button-size-label" : "XX-large",
    "button-size" : "xx-large"
    },
    {
    "button-size-label" : "XXX-large",
    "button-size" : "xxx-large"
    }
  ]
}