{
  "title": "Color Palette",

  "reference-overview": 
  	"<p class='evo-intro-text'>We automatically associate certain things with specific colors. For instance, what do you think of when you see the color red? \"Stop,\" right? Or, perhaps, \"wrong answer?\" What about yellow? \"Caution?\" Color is also important when it comes to branding. The famous big yellow arch for McDonald's will always be yellow, not green or blue or purple.</p>",

  "reference-color-hdr":
  	"Baseline",
  "reference-color-content":
  	"<p>The following baseline colors are consistent with the Mercer brand and are used for all basic elements for applications and sites, like the base font and the navigation menu.</p>",

  "reference-color-hdr-2":
  	"Confirmation/Positive",
  "reference-color-content-2":
  	"<p>Green denotes a positive experience, and users tend to associate it with a confirmation, a positive result or a correct answer. In our applications, it is reserved for this use.</p>",

  "reference-color-hdr-3":
  	"Error/Negative",
  "reference-color-content-4":
  	"<p>Red tends to signify that something is wrong or incorrect. We've softened this up a bit by using a pink/rose color scheme for errors instead of a bold red, so we can convey that same message without the harshness. In our applications, red is used to denote an error, a negative amount or an incorrect response.</p>",

  "reference-color-hdr-4":
  	"Attention/Highlight",
  "reference-color-content-4":
  	"<p>Since the color yellow is often associated with calling attention or highlighting, we use a yellow color scheme when users need to be alerted to something on the screen. This way, when users see the color yellow appear on a site or application, they know they need to pay particular attention to that item.</p>",

  "reference-color-hdr-5":
  	"Interactive Data Tables",
  "reference-color-content-5":
  	"<p>Interactive Data Tables need to have color so users can easily interpret the data presented, but at the same time, the colors should be soft as not to direct attention away from the table's content. Mercer's color scheme for all interactive data tables is a collection of soft light blues.</p>",

  "reference-color-hdr-6":
  	"Buttons",
  "reference-color-content-6":
  	"<p>Primary and secondary buttons can be easily distinguished by using different colors: sapphire-dark for primary and gray-lighter for secondary. The sapphire-dark will instantly draw users to primary buttons as they are the ones that need to be addressed first.</p>",

  "reference-color-hdr-7":
  	"Entity Profiles",
  "reference-color-content-4":
  	"<p>The following colors are reserved for use with specific site/application entities (like Client profile, User profile, etc). The colors will be used primarily in the profile header for the specific entity. They will also be used as accents  throughout various elements within the entity profile.</p>"
}