{
	"title": "Product Header",

	"reference-overview": 
		"<p>The Product Header consists of a combination of the following two components:.</p><ul><li><a href='/base/header/masthead'>Masthead</a></li><li><a href='/base/header/navbar'>Navigation Bar</a></li></ul><p>Each of these two components offers many different configurations. A few of the more common configurations are listed below.</p>",

	"reference-usage": 
		"<p>The Product Header should be used when it is important to provide a consistent main navigation option that is displayed on every screen, and when the number of main navigation options is manageble number (less than 7 or so).</p><p>There is an alternative option called the <a href='/base/toolbar-header'>Toolbar Header</a> that can be used when branding is less important.</p>",

	"reference-details": 
		"<ul><li>The two main pieces of the Product Header are the <a href='/base/header/masthead'>Masthead</a> and the <a href='/base/header/navbar'>Navigation Bar</a>. Click the name of each component to get more information.</li><li>The Product Header will span the entire width of the screen area, but the content area is contained within a 960px area centered on the screen.</li></ul>",

	"reference-mobile": 
		"<p>The Product Header is responsive for mobile. Click into the details for each component to learn more:</p><ul><li><a href='/base/header/masthead'>Masthead</a></li><li><a href='/base/header/navbar'>Navigation Bar</a></li></ul>",

	"reference-technical": 
		"<p>Technical details go here....</p>",

	
	"reference-dependency": "false",
	"reference-dependency-jquery": "false",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "true",
	"reference-example-version-label": "Version 1",
	"reference-example-description": "This common configuration of the Product Header contains a Product Name and User Identifier in the <a href='/base/header/masthead'>Masthead</a>. The tab version of the <a href='/base/header/navbar'>Navigation Bar</a> is used, and it also uses a selection of icons tied to slide down menus.",
	"reference-example-version-label-2": "Version 2",
	"reference-example-description-2": "This version of the Product Header shows a <a href='/base/header/masthead'>Masthead</a> with the User Identifier replaced with a company logo. The tab version of the <a href='/base/header/navbar'>Navigation Bar</a> is used again, but this time without any supplemental icon navigation options.",
	"reference-example-version-label-3": "Version 3",
	"reference-example-description-3": "An optional Product Logo has been added to the <a href='/base/header/masthead'>Masthead</a> in this configuration of the Product Header. The Masthead also contains the Product Name and the User Identifier control. The text version of the <a href='/base/header/navbar'>Navigation Bar</a> is used here, along with the Menu icon on the left and a selection of additional Icons to the right of the text links.",
	"reference-example-version-label-4": "Version 4",
	"reference-example-description-4": "In this version of the Product Header, the <a href='/base/header/masthead'>Masthead</a> contains both a Product Logo on the left and a Company Logo on the right. The User Identifier has been moved to the <a href='/base/header/navbar'>Navigation Bar</a>, which uses the tabs version in this example.",

	"reference-get-code": "false",

	"reference-code-html-content-block-pre": 
		"",
	"reference-code-html-content-block-post": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}