{
	"title": "Toolbar Header",

	"reference-overview": 
		"<p>The Toolbar Header is a small, compact alternative to the <a href='/base/product-header'>Product Header</a>.</p>",

	"reference-usage": 
		"<p>The Toolbar Header should be used as the primary navigation option in the following scenarios:</p><ul><li>when more of the screen real estate needs to be dedicated to content/functionality.</li><li>when the primary users of the product are power users who can easily understand and access navigation via icons.</li><li>when product branding in the header is less important. </li></ul>",

	"reference-details": 
		"<ul><li>The Toolbar Header has a height of 40px.</li><li>The Toolbar Header is permanently affixed to the top of the browser window.</li><li>The content within the Toolbar Header spans 100% of the width of the browser.</li><li>The Toolbar Header offers multiple configuration options. The possible content that can be used includes:</li><ul><li>Product Name</li><li>Menu Icon</li><li>Optional Icons</li><li>Text Links</li><li>User Identifier</li></ul></ul>",

	"reference-mobile": 
		"<ul><li>Any text links will be moved out of the main navigation and into the Menu icon.</li><li>Any of the additional icons, if used, will be removed from the Toolbar Header.</li><li>The User Identifier, if used, will be removed from the Toolbar Header and into the Menu icon.</li></ul>",

	"reference-technical": 
		"<p>technical details go here...</p>",

	
	"reference-dependency": "false",
	"reference-dependency-jquery": "false",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "true",
	"reference-example-version-label": "Product Name & Menu Icon",
	"reference-example-description": "This base version of the Toolbar Header contains the standard Product Name along with the Menu icon. Clicking or tapping the menu icon will expose a menu that contains the main navigation options.",
	"reference-example-version-label-1": "Product Name & Mega Icon & Optional Icons",
	"reference-example-description-1": "This version adds on to the base version with the addition of more supporting icons. These can include, but are not limited to,things like Shopping Cart, Notification Center, Documents and more.",
	"reference-example-version-label-2": "Product Name & Mega Icon & Optional Icons & Text Links",
	"reference-example-description-2": "This version layers in additional text links to the navigation. When used in conjunction with the Menu icon, these text links should be ancillary in nature, and not representative of the core structure.",
	"reference-example-version-label-3": "Product Name & Mega Icon & Optional Icons & User Identifier",
	"reference-example-description-3": "This version replaces the text links with the User Identifier control. ",

	"reference-get-code": "false",

	"reference-code-html-content-block-pre": 
		"",
	"reference-code-html-content-block-post": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}