{
	"title": "Quick Filter",

	"reference-overview": 
		"<p>The Quick Filter/Autocomplete control syphons data as the user types search characters into a <a href='/base/forms/stacked'>Text Input</a> field on a table. It enables users to quickly find and select from a pre-populated list of values as they type. By entering more characters, the user can filter down the list to produce better matches. The Quick Filter/Autocomplete feature is used along with the <a href='/base/tables/interactive'>Interactive Data Table</a> to give the user control of the search results.</p>",

	"reference-usage": 
		"<p>When there is a lot of data displayed on a table, you can use the Quick Filter/Autocomplete control. This will allow you to search quickly for the information you are looking for and filters out excess unneeded data.</p>",

	"reference-details": 
		"<h3>Functionality</h3><ul><li>The Quick Filter/Autocomplete control will begin syphoning out data as soon as the user enters the first character into the Text Input field. There is no character minimum.</li></ul><h3>Color</h3><ul><li>The Quick Filter/Autocomplete's Text Input field should default to the <a href='/base/colors'>Attention/Highlight</a> border color when the user clicks inside the box.</li></ul><h3>Width/Height</h3><ul><li>The designer can set the width parameters of the Quick Filter/Autocomplete control.</li><li>The height of the Quick Filter/Autocomplete control is variable. <strong></strong></li></ul>",

	"reference-mobile": 
		"<p>On Mobile, the Quick Filter appears left aligned at the top of the table and enables users to quickly find and select from a pre-populated list of values as they type. This differs from the desktop view where the field is right aligned at top of table. When static and interactive data tables are viewed on mobile/tablet devices, the table will remain unchanged and displayed as seen on the desktop. When the user touches the screen (or swipes to the left) a scroll bar will appear which allows them to view the entire data table. They are then able to swipe right and left to view the contents. </p>",

	"reference-technical": 
		"<h3>Header</h3><p>Technical details go here. This is a <a href='/objects/mini-filter'>link</a>.</p><h4>Sub Header</h4><ul><li>List item 1</li><li>List item 2</li><li>List item 3</li></ul><h4>Sub Header</h4><ol><li>List item 1</li><li>List item 2</li><li>List item 3</li></ol><dl><dt>Definiton term</dt><dd>Definiton description</dd><dd>Definiton description</dd><dd>Definiton description</dd></dl>",

	
	"reference-dependency": "true",
	"reference-dependency-jquery": "true",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"<li>FooTables 2.0</li><li>FooTables 2.0 - Filter Plugin</li>",

	"reference-example-versions": "true",
	"reference-example-version-label":
		"Quick Filter",
	"reference-example-version-label-2":
		"Interactive Table calling Quick Filter",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"<p>Make sure to follow the table layout from the table section when adding these to your table.</p>",
	"reference-code-html-content-block-post": 
		"",
	"reference-code-html-content-block-pre-2": 
		"<p>Make sure the <code>id</code> of the Quick Filter input matches the <code>data-filter</code> attribute value (example: <code>data-filter=\"#filter\"</code>) on your interactive table. The <code>data-filter</code> value will always have a <code>#</code> on the front. These need to match for the Quick Filter to be able to filter the table results.</p>",
	"reference-code-html-content-block-post-2": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}