{
	"title": "Static Data Table",

	"reference-overview": 
		"<p>The Static Data Table is an element meant to organize data on a page so it’s easy for the user to view and comprehend on a page or application.</p>",

	"reference-usage": 
		"<p>Use the Static Data Table when you want to organize data that the user doesn’t need to interact with. If the user needs to interact with the data (search, filter, take clickable actions, etc) use the <a href='/base/tables/interactive'>Interactive Data Table</a>.</p>",

	"reference-details": 
		"<ul><li>The Static Data Table works within the <a href='/base/grids'>Mercer Grid System</a>, which means the sizing is flexible and fluid to adapt to designer’s choices, user devices, and varying screen sizes.</li><li>Don’t use the Static Data Table in a <a href='/base/boxes/container-sidebar'>Sidebar Container</a> or <a href='/base/layout-sidebar'>Sidebar Layout</a>, unless you only need to display a small amount of data.</li></ul><h3>Color</h3><ul><li>Coloring for each row in the Static Data Table will adhere to the <a href='/base/colors'>Mercer Color Palette</a> for all Data Tables.</li></ul><h3>Width</h3><ul><li>Designer can set column width using a helper class. Since the Static Data Table functions within the Mercer Grid System, it will automatically adapt and configure itself.</li></ul><h3>Row Details</h3><ul><li>Padding for Static Data Table rows are set to 5 pixels on the top and bottom and 10 pixels to the left and right.</li><li>Line height of Static Data Table rows are 13 pixels to keep text consistent with Mercer branding.</li><li>Some rows can be assigned a Right Align Helper Class to alter rows that might not have the same amount of content fields as other rows, such as the Subtotal and Total rows.</li><li>Text will wrap in basic rows to adapt to longer content, but the label rows will stay in the same position, which is vertically aligned to the top of the row.</li></ul>",

	"reference-mobile": 
		"<p>When static and interactive data tables are viewed on mobile/tablet devices, the table will remain unchanged and displayed as seen on the desktop. When the user touches the screen (or swipes to the left) a scroll bar will appear which allows them to view the entire data table. They are then able to swipe right and left to view the contents. The Quick Filter appears at the top of the table and enables users to quickly find and select from a pre-populated list of values as they type.</p>",

	"reference-technical": 
		"<h3>Header</h3><p>Technical details go here. This is a <a href='/objects/mini-filter'>link</a>.</p><h4>Sub Header</h4><ul><li>List item 1</li><li>List item 2</li><li>List item 3</li></ul><h4>Sub Header</h4><ol><li>List item 1</li><li>List item 2</li><li>List item 3</li></ol><dl><dt>Definiton term</dt><dd>Definiton description</dd><dd>Definiton description</dd><dd>Definiton description</dd></dl>",

	
	"reference-dependency": "false",
	"reference-dependency-jquery": "false",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "false",
	"reference-example-version-label":
		"",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"<p>Below is the static table you get with the following effects by default:</p><ul><li>Striped rows and Bordered table</li></ul>",
	"reference-code-html-content-block-post": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}