{
	"title": "Accordion",

	"reference-overview": 
		"<p>The accordion control provides an effective way to display chunks of information in a condensed fashion.</p>",

	"reference-usage": 
		"<ul><li>The accordion can be used when an extensive amount of content needs to be displayed in a compact manner. </li><li>Should only be used with a smaller number of sections, as too many sections will lead to some of the section headers being out of view.</li> <li>Avoid using the accordiion in forms where data is required across multiple sections. This could lead to consistent usability issues with regard to the user's awareness of required fields.</li><li>Avoid using an accordion if the amount of the content within a section is so expansive that it will require a lot of scrolling.</li><li>Avoid nesting one accordion control inside of another.</li></ul>",

	"reference-details": 
		"<ul><li>Header information can be placed within the colored fields.</li><li>Additional content can be viewed by clicking or tapping the blue header or optional expand icon.</li><li>As the user selects to expand a specific content area, any other open content area will close. This is the default behavior, but the control is configurable to allow for multiple sections to be open at once.</li><li>The background color for the header is a standard blue hex #e8f0f7.</li><li>Text size for the headers is set as an H4 class by default but can be modified as necessary. </li></ul>",

	"reference-mobile": 
		"<ul><li>The accordion is an effective control for mobile as it provides the user with an initial \"summarized\" view of content via the section headers and gives the user the ability to view a deeper level of content via tapping interaction.</li><li>The accordion fully scales and functions on mobile devices.</li><li>The accordion will span the width of the mobile device.</li><li>The overall font sizes will increases slightly for mobile.</ul>",

	"reference-technical": 
		" <p>The accordion is compatible will all current A and B grade browsers that Evolution currently supports.</p>",

	
	"reference-dependency": "false",
	"reference-dependency-jquery": "false",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "true",
	"reference-example-version-label":
		"Default",
	"reference-example-version-label-2":
		"Icons",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"",
	"reference-code-html-content-block-post": 
		"",
	"reference-code-html-content-block-pre-2": 
		"",
	"reference-code-html-content-block-post-2": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		"",
	"reference-code-js-content-block-pre-2": 
		"",
	"reference-code-js-content-block-post-2": 
		""
}