{
	"title": "Alternate Views Badge",

	"reference-overview": 
		"<p>The Alternate Views Badge allows the user to switch back and forth between \"alternate views\" of related content in the same area. It is a more visual and expanded solution than <a href='/objects/tabs'>Tab Set</a> control.</p>",

	"reference-usage": 
		"<p>The alternate views badge is used to switch back and forth quickly from one large content area to another. This function applies well to areas where real estate on the page is condensed and another page is not necessary to display the content. In a sense, the alternate views page can be defined as sub-navigation within a particular section.</p>",

	"reference-details": 
		"<h3>Variations</h3><p>There are three hierarchical levels to the Alternate Views Badge:</p><dl><dt>Full Badge</dt><dd>Contains both icons and text labels</dd><dd>Should be centered on the screen</dd><dd>Should be used when the ability to switch views needs to be featured prominently</dd></dl><dl><dt>Icons Only</dt><dd>Text label is not displayed on screen, so each icon stands on its own</dd><dd>The text label can be added via the <a href='/objects/tooltip'>Tooltip</a> control</dd><dd>Should be aligned either right or left.</dd></dl><dl><dt>Text Only</dt><dd>No icon is used, so the text label exists on its own.</dd><dd>Text labels so should be short, concise and descriptive</dd><dd>Should be aligned either right or left.</dd></dl><h3>More Details</h3><ul><li>The alternate views badge switches content within the same table</li><li>The alternate views badge can have iconography and or text descriptions</li><li>The badges can be center, left or right justified depending on need</li><li>When a badge is selected, hidden data replaces current data</li></ul>",

	"reference-mobile": 
		"<ul><li>The font size increases for mobile.</li><li>The Full Badge version will drop the text label from the initial display on mobile devices (converting to the Icon Only view).</li><li>The individual badges within the Text Only version will stack for mobile as necessary.</li></ul>",

	"reference-technical": 
		"<h3>Cross browser compatibility</h3><p>The Alternate Views Badge control is compatible will all current A and B grade browsers that Evolution currently supports.</p><p>IE9 doesn't crop background gradients on containers with rounded corners, so we square the corners of every container so it looks just like IE8.</p>",

	
	"reference-dependency": "true",
	"reference-dependency-jquery": "true",
	"reference-dependency-jquery-ui": "true",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "true",
	"reference-example-version-label":
		"Full Badge",
	"reference-example-version-label-2":
		"Icon Only",
	"reference-example-version-label-3":
		"Text Only",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"",
	"reference-code-html-content-block-post": 
		"",
	"reference-code-html-content-block-pre-2": 
		"",
	"reference-code-html-content-block-post-2": 
		"",
	"reference-code-html-content-block-pre-3": 
		"",
	"reference-code-html-content-block-post-3": 
		"",

	"reference-code-js": "true",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		"",
	"reference-code-js-content-block-pre-2": 
		"",
	"reference-code-js-content-block-post-2": 
		"",
	"reference-code-js-content-block-pre-3": 
		"",
	"reference-code-js-content-block-post-3": 
		""
}