{
	"title": "Calendar",

	"reference-overview": 
		"<p>The Calendar control allows the user to select a specific date, or with multiple entries, a date range. It automatically defaults to show a 1-month range with the current month visible. Users can click on the month and year drop downs to select the month and year they need. Users can also click the arrow to the right of the year drop down to advance to the next month.</p><p>The Calendar control is related to the <a href='/objects/date-range'>Date Range</a> control.</p>",

	"reference-usage": 
		"<p>A Calendar function is helpful when the site/application needs the user to select a date for something, like a start date for an online employment application.</p><p>Users can also select a date range, for instance if they are looking for a flight, they might need departure and arrival dates.</p>",

	"reference-details": 
		"<ul><li>The graphical 1-month calendar can be opened in 4 ways:<ul><li>Clicking on the calendar label (\"Date.\")</li><li>On focus of the calendar input box</li><li>Clicking the calendar input box</li><li>Clicking the calendar icon</li></ul></li><li>When the calendar control is opened, the current date is highlighted in green</li><li>The control has an optional message component. Messages would be related to the date selected</li><li>Date format is configurable to m/d/yy (which is the default) or mm/dd/yyyy</li><li>For Masked Date Input the format is configured to mm/dd/yy</li><li>Dates must use /s, not -s.</li><li>Selecting a date inserts the chosen date into the text field and closes the control.</li><li>Calendar should be configured so it won't accept letters. Users can only enter numbers into the text field.</li><li>Calendar should navigate user to the desired date as it is typed in the text field.</li><li>Calendar date range is configured in coding. Designer can select the minimum and maximum search dates.</li><li>If a user tries to search beyond the pre-determined minimum and maximum dates, the calendar will automatically go to the last possible date it can access.</li></ul>",

	"reference-mobile": 
		"<ul><li>All versions of the calendar control labels become stacked.</li><li>The default behavior is to use the evolution calendar control instead of the native version in order to take advantage of the logic built into our control. (e.g., the ability to support a message, and the ability to support unselectable dates)</li><li>The default version of the calendar doesn’t allow for text input, and therefore does not invoke the device keyboard. Displaying both the default calendar control and the device keyboard would be a confusing experience for the user.</li><li>When displayed, the calendar should be both horizontally and vertically centered in the viewport and inherit the container margins.</li><li>The font size increases for mobile</li></ul>",

	"reference-technical": 
		"<h3>Cross Browser Compatibility</h3><p>IE9 doesn't crop background gradients on containers with rounded corners, so we square the corners of every container.</p><h3>Dependencies</h3><p>Our Calendar feature is a jQuery UI control by the name of Date Picker. For more information on jQuery UI Date Picker and the configurable options available, check out the <a href='http://api.jqueryui.com/datepicker/'' target='_blank'>jQuery UI Date Picker API</a>. This site is maintained by The jQuery Foundation, not Mercer.</p>",

	
	"reference-dependency": "true",
	"reference-dependency-jquery": "true",
	"reference-dependency-jquery-ui": "true",
	"reference-dependency-list": 
		"<li>jQuery Masked Input Plugin 1.3.1</li>",

	"reference-example-versions": "true",
	"reference-example-version-label": "Read Only",
	"reference-example-version-label-2": "Date Input",
	"reference-example-version-label-3": "Message",
	"reference-example-version-label-4": "Masked Input",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": "",
	"reference-code-html-content-block-post": "",
	"reference-code-html-content-block-pre-2": "",
	"reference-code-html-content-block-post-2": "",
	"reference-code-html-content-block-pre-3": "",
	"reference-code-html-content-block-post-3": "",
	"reference-code-html-content-block-pre-4": "",
	"reference-code-html-content-block-post-4": "",

	"reference-code-js": "true",
	"reference-code-js-content-block-pre": "",
	"reference-code-js-content-block-post": ""
}