{
	"title": "Content Modal",

	"reference-overview": 
		"<p>The Content Modal Window provides information for the user that supplements the current page without taking the user away from it. This window allows large amounts of content to be displayed on a page in multiple layers and subsections without cluttering the user interface.</p>",

	"reference-usage": 
		"<p>You can use the Content Modal Window when you need to provide more information for users without taking them away from the current page. For example, users need to read content on a homepage, but the designer wants to provide an extra layer of supplemental content they can opt to read to further comprehension. A Content Modal Window is the perfect solution.</p>",

	"reference-details": 
		"<h3>Functionality</h3><ul><li>When the Content Modal Window is activated, the rest of the screen (the content/page behind it) is disabled until the user closes it by clicking on the X located in the top right corner or clicking on the overlay outside if the modal window.</li><li>Content Modal Windows will contain the \"close\" icon (white circle with a blue X inside) so the user can close the window when desired.</li></ul><h3>Width/Height</h3><ul><li>The Content Modal Window has two available widths: 980px and 1200px. This width is based on the overall width of the site underneath the modal window. If a site width of 980px is choosen, the content modal will be 980px wide.</li><li>The Content Modal Window's height is dependent on the height of the browser window.</li></ul>",

	"reference-mobile": 
		"<p>Left hand column with &quot;action&quot; icons remains a fixed size, while the content area becomes scroll able. Font size increases. &quot;Close&quot; scrolls with content area.</p>",

	"reference-technical": 
		"<h3>Cross browser compatibility</h3><p>IE9 doesn't crop background gradients on containers with rounded corners, so we square the corners of every container so it looks just like IE8.</p><h3>Dependencies</h3><p>The Content Modal Window is based off a jQuery UI control called Dialog Widget. For more information on the jQuery UI Dialog Widget, check out the <a href='http://api.jqueryui.com/dialog/'' target='_blank'>jQuery UI Dialog Widget API</a>. This site is maintained by the jQuery Foundation, not Mercer.</p><p>The Scroll Pane Plugin is dependent on jQuery as well.</p>",

	
	"reference-dependency": "true",
	"reference-dependency-jquery": "true",
	"reference-dependency-jquery-ui": "true",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "",
	"reference-example-version-label":
		"",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"",
	"reference-code-html-content-block-post": 
		"",

	"reference-code-js": "true",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}