{
	"title": "Banding Layout",

	"reference-overview": 
		"<p>The Banding Layout is a base template that allows the product to display groups of disparate content, separated from one another by bands of color that span the full width of the browser window.</p>",

	"reference-usage": 
		"<p>The Banding Layout should be used primarily on landing pages, specifically when the pages are dense with different groupings of content. The color differences between the bands will help create a visual distinction between the groups of content.</p><p>The Banding Layout can often be used in conjunction with the background image version of the <a href='/objects/layout-hero-banner'>Hero Banner</a> layout to create a more visually compelling display.</p>",

	"reference-details": 
		"<ul><li>The color of each band can be set individually, using any of the colors from the <a href='/base/colors'>Color Palette</a>.</li><li>The height of each band is variable, and will be determined by the content included in the band.</li><li>There is a default 40px margin added to the top and bottom of each band to create more separation between bands.</li></ul>",

	"reference-mobile": 
		"<ul><li>The Banding Layout is completely responsive for mobile.</li><li>The bands span 100% of the width of the browser, and that will apply for mobile as well.</li></ul>",

	"reference-technical": 
		"<p>Technical details go here</p>",

	
	"reference-dependency": "false",
	"reference-dependency-jquery": "false",
	"reference-dependency-jquery-ui": "false",
	"reference-dependency-list": 
		"",

	"reference-example-versions": "true",
	"reference-example-version-label":
		"",
	"reference-example-version-content":
		"<p>This sample of the Banding Layout uses placeholder colors to denote the different bands of content.</p>",

	"reference-get-code": "false",

	"reference-code-html-content-block-pre": 
		"",
	"reference-code-html-content-block-post": 
		"",

	"reference-code-js": "false",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		""
}