{
	"title": "Modal Window",

	"reference-overview": 
		"<p>The Modal Window provides information to the user that supplements or impacts the current site or application page. Examples of Modal Windows include a small window popping up to allow for editing data on a form, a separate window providing more details for the current entity, or using a mini \"wizard\" flow to present separate information.</p>",

	"reference-usage": 
		"<p>A Modal Window is different from a Pop-Up Window because it actually disables the page behind it and only allows the user access to the content in the Modal Window until the required action is complete or the user chooses to close out of the Modal Window.</p><p>When the page is long enough to scroll, the page should scroll, while the modal remains in a fixed position.</p><p>At Mercer, we use three different Modal Windows:</p><ul><li>Default with short content<ul><li>The height of this Modal Window is content aware and will adapt based on the amount of dialogue content.</li><li>When you hit that max content height of 530, the Scrolling Mechanism feature is activated.</li><li>The headline section is not considered part of the content dialogue.</li></ul></li><li>Default with long content (Auto Scrolling)<ul><li>Once the content in the Modal Window hits the content area max height, the Auto Scrolling feature is automatically activated.</li><li>The user must scroll through the content to get to the Modal Window buttons.</li></ul></li><li>Default with long content and fixed buttons (Auto Scrolling)<ul><li>This version is similar to the above Modal Window, but it includes buttons that are fixed in a footer near the end of the Window, not directly after the content.</li><li>The user doesn’t have to scroll through all the content in order to access the buttons.</li></ul></li></ul><p>You can use the Modal Window when you need to provide information to the user that supplements or impacts the current page the user is viewing. For example, the user needs to edit a specific section on a form or complete a separate task. Modal Windows also work well if an animation or video needs to be shown.</p><p><h3>Modal Window with Fixed Buttons</h3><p>A Modal Window with fixed buttons is great when you have a lot of content that needs to be displayed, but you want the user to be able to access the buttons without having to scroll through the entire block of content first. This type of Modal Window works well if the user has to accept terms or conditions before moving on with filing out a form or completing a required action.</p>",

	"reference-details": 
		"<ul><li>When the Modal Window is activated, the rest of the screen (the content/page behind it) is disabled.</li><li>By default, the user can drag the Modal Window to any location on the page. This feature can be turned on or off by the designer if desired.</li><li>The Modal Window height is variable as it is dependent on content, but it does have a max height of 600 pixels.<ul><li>Modal Windows with fixed buttons have a max height of 648 pixels.</li></ul></li><li>The Auto Scrolling feature has fixed components:<ul><li>This feature is enabled when the content area of the Modal Window reaches the max height of 300 pixels.</li><li>The Scrollbar will be visible to user while content loads.</li></ul></li><li>The Modal Window width is variable, but it does have a default width of 500 pixels.<ul><li>The designer can override the default width value in the JS code to adapt to the page design, page space, or Modal Window purpose.</li></ul></li><li>Modal Windows will contain buttons since the user will have to take an action.<ul><li>Follow Mercer Button protocol for colors and functions.</li><li>Buttons can be fixed in the Modal Window or included as part of the content as described above.</li><li>Save or Cancel Buttons will have the functionality to close the Modal Window once the user completes the required task.</li><li>Fixed buttons are jQuery UI controls.</li></ul></li><li>Modal Windows will contain the “close” icon (white circle with a blue X inside) so the user can close the window once the required task is completed.</li></ul>",

	"reference-mobile": 
		"<h3>Header</h3><p>Mobile details go here. This is a <a href='/objects/mini-filter'>link</a>.</p><h4>Sub Header</h4><ul><li>List item 1</li><li>List item 2</li><li>List item 3</li></ul><h4>Sub Header</h4><ol><li>List item 1</li><li>List item 2</li><li>List item 3</li></ol><dl><dt>Definiton term</dt><dd>Definiton description</dd><dd>Definiton description</dd><dd>Definiton description</dd></dl>",

	"reference-technical": 
		"<h3>Cross browser compatibility</h3><p>IE9 doesn't crop background gradients on containers with rounded corners, so we square the corners of every container so it looks just like IE8.</p>",

	
	"reference-dependency": "true",
	"reference-dependency-jquery": "true",
	"reference-dependency-jquery-ui": "true",
	"reference-dependency-list": 
		"<li>jQuery Mouse Wheel Intent 1.2</li><li>jQuery UI Dialog - Click Outside Plugin</li>",

	"reference-example-versions": "true",
	"reference-example-version-label":
		"Default settings",
	"reference-example-version-label-2":
		"Auto scrolling",
	"reference-example-version-label-3":
		"Fixed buttons (auto scrolling)",
	"reference-example-version-label-4":
		"Click Outside Modal to Close",

	"reference-get-code": "true",

	"reference-code-html-content-block-pre": 
		"",
	"reference-code-html-content-block-post": 
		"",
	"reference-code-html-content-block-pre-2": 
		"",
	"reference-code-html-content-block-post-2": 
		"",
	"reference-code-html-content-block-pre-3": 
		"",
	"reference-code-html-content-block-post-3": 
		"",
	"reference-code-html-content-block-pre-4": 
		"",
	"reference-code-html-content-block-post-4": 
		"",

	"reference-code-js": "true",
	"reference-code-js-content-block-pre": 
		"",
	"reference-code-js-content-block-post": 
		"",
	"reference-code-js-content-block-pre-2": 
		"",
	"reference-code-js-content-block-post-2": 
		"",
	"reference-code-js-content-block-pre-3": 
		"",
	"reference-code-js-content-block-post-3": 
		"",
	"reference-code-js-content-block-pre-4": 
		"",
	"reference-code-js-content-block-post-4": 
		""
}