{
  "title": "Page Error Messaging &amp; Handling",

  "reference-overview": 
  	"<p>In order to make the user experience as smooth as possible, we've defined a unified way to handle all server side Error Message scenarios so they are consistent across all Mercer sites and applications.</p><p>This common error handling pattern involves two main components:</p><ul><li>Generic Error Messaging</li><li>Field Specific Error Messaging</li></ul><p>The Error Message container appears whenever the user makes a mistake on a Form Element, like failing to fill out a required Text Input field, along with the Field Specific Error Message that pinpoints where exactly on the form the error or errors occurred.</p><h3>Orientation</h3><p>As soon as users hit the Form's Submit Button, they are automatically reoriented to the top of the page where they will immediately see the generic Error Message.</p><h3>Generic Messaging</h3><p>Whenever any type of server side error occurs, the system should display the <a href='/base/boxes/message-error'>Error Message Container</a> across the top of the page, directly below the Page Title. The message container is designed to display a generic error message that will highlight to the user that something went wrong. The text will instruct the user to review the content below for details.</p><h3>Field Specific Error Messaging</h3><p>As users scroll down until they come to the Text Input field that is incorrect. This field will be highlighted with the appropriate Error/Negative Color Pallet and Error Icon (Red circle with exclamation mark inside). There will also be a brief explanation of what the user did wrong right below the Text Input field.</p><p>We handle error interaction with users in this way because we feel it's easier to digest. There is an alternate way to handle Error Messaging that brings the user directly to the incorrect Text Input field. However, we feel this isn't the best way to handle a user error because it isn't always clear what went wrong, especially since it's possible to make more than one error on a Form.</p>",

  	"reference-related-components-hdr": "Related Components",

  	"reference-related-components-content": 
  		"<p>The following components are all related to this narrative.</p><ul><li><a href='/base/boxes/message-error'>Error Message Container</a></li><li><a href='/base/forms/field-specific-error'>Field Specific Error Messaging</a></li><li><a href='/base/icons'>Required Icon</a></li></ul>"
}